assignments/assg11/assg-11-multiple-indirection.tex
% Created 2015-04-15 Wed 10:05
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage{minted}
\usemintedstyle{default}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Assg 11: Multiple Indirection of Pointers}
\author{CSci 515 Spring 2015}
\date{2015-04-14}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Assg 11: Multiple Indirection of Pointers},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\section*{Dates:}
\label{sec-1}


\begin{center}
\begin{tabular}{ll}
 Due:  &  Tuesday April 21, by Midnight  \\
\end{tabular}
\end{center}
\section*{Objectives}
\label{sec-2}

\begin{itemize}
\item Learn about pointers to pointers to pointers (multiple dereferencing)
\item Practice more with using structs
\item Learn about dereferencing struct members that are pointed to by a pointer
  variable.
\item Learn about chaining memory references, and multiple dereferences to 
  manipulate data.
\end{itemize}
\section*{Description}
\label{sec-3}

In this assignment we will focus on some practice examples where we
have multiple chains of pointer references, that we want to
dereference simultaneously in order to get to some data to manipulate
it.  This assignment is broken up into two parts.  In the first part
we will simply create a chain of pointers, and practice dereferencing
them.  In the second part, we will create a structure that has a
self-referential pointer in the definition, and use this
self-referential pointer to create a circular chain of structure
references.  You don't have to write any functions for your assignment
for this week, so all of the code and tasks you are asked to perform
next should simply be done in your \verb~main()~ function in the program
that you submit.  Also, I encourage you to create diagrams of memory
and the pointers/structures you are creating while you do the two
parts of this exercise.  When learning pointers and dereferencing
memory, it can be useful to diagram out the relationships you create
visually, so you can better follow along with what you need to do with
your code.
\subsection*{Part 1: Pointers to Pointers (to Pointers)}
\label{sec-3-1}

Perform the following tasks in the \verb~main()~ function of your program.

\begin{enumerate}
\item Create a regular floating point variable named \verb~f~.  Create a
   pointer to a float called \verb~fPtr~.  Create a pointer to a pointer
   to a float called \verb~fPtrPtr~ (two levels of indirection).  And
   finally create a pointer to a pointer to a pointer to a float
   called \verb~fPtrPtrPtr~ (three levels of indirection).
\item Initialize the 4 variables you created in Step 1.  Initialize
   your \verb~f~ variable with the value $42.42$.  Then initialize
   the \verb~fPtr~ pointer variable to point to \verb~f~.  Likewise initialize
   your \verb~fPtrPtr~ variable to point to \verb~fPtr~, and finally for the
   third level of indirection, \verb~fPtrPtrPtr~ should be initialized
   to point to \verb~fPtrPtr~.
\item Output the value you stored in f by directly reading the value from
   f using iostream output to cout.  Then access the value in f and
   display it using 1, 2 and 3 levels of dereferencing using the
   \verb~fPtr~, \verb~fPtrPtr~ and \verb~fPtrPtrPtr~ pointer variables respectively.
   You must use the dereference operator correctly for this step.
   See the example output below for what you should display on standard output.
\end{enumerate}
\subsection*{Part 2: Self-referential Pointers in Structures}
\label{sec-3-2}

Here is a structure that contains a self-referential pointer inside of
the structure definition.  Put this definition of the \verb~IntegerItem~
user defined type at the top of your program before you \verb~main()~
function.


\begin{verbatim}
// A structure to hold an Integer
// and a pointer to some other item.
struct IntegerItem
{
  int value;
  IntegerItem* nextPtr;
};
\end{verbatim}

Perform the following tasks for part 2 of the assignment in your \verb~main()~ function:

\begin{enumerate}
\item Create 4 instances/variables of type \verb~IntegerItem~.  Name your
   instances \verb~a~, \verb~b~, \verb~c~ and \verb~d~.
\item Initialize the value member of your 4 instances to the values \verb~5~,
   \verb~7~, \verb~10~ and \verb~15~ for \verb~a~, \verb~b~, \verb~c~ and \verb~d~ respectively.
\item Initialize the \verb~nextPtr~ members of each of your instances.  Notice
   that \verb~nextPtr~ is a pointer to an \verb~IntegerItem~ type.  Assign the
   \verb~nextPtr~ member of your \verb~a~ item to point to \verb~b~.  Then assign
   \verb~b~'s \verb~nextPtr~ to point to \verb~c~.  \verb~c~ should point to \verb~d~.  And
   finally, create a circular chain of references by causing \verb~d~'s
   \verb~nextPtr~ member to point to \verb~a~.
\item Create two pointer variables that will point to \verb~IntegerItem~, and
   name these variables \verb~aPtr~ and \verb~cPtr~ respectively.  Initialize 
   \verb~aPtr~ so that it is pointing to (has the address) of item \verb~a~.
   Likewise, initialize \verb~cPtr~ so that it is pointing to item \verb~c~.
\item Using \verb~aPtr~ and the \verb~->~ member dereference operator, access and
   display the value of \verb~a~ using an iostream operation to cout.  The
   value in \verb~a~ should be \verb~5~ if you performed the initializations in
   step 2 correctly.
\item Again using \verb~aPtr~ and the \verb~->~ member dereference operator, access the
   value in \verb~c~ by chaining together two dereferences through the \verb~nextPtr~
   member pointer variables.  Display the value you access to cout.  You must
   do this access starting from \verb~aPtr~ and using only the \verb~->~ dereference operator.
\item Using \verb~cPtr~ and the \verb~->~ member dereference operator, follow the links
   for 3 hops and display the value you find.  Again you must start at \verb~cPtr~
   and only use \verb~->~ dereference operations.
\item Using \verb~aPtr~ and the \verb~->~ member dereference operator, follow the
   links in your chain for 4 hops.  If you did this correctly, you
   should of course end up back at \verb~a~ where you started.
\end{enumerate}

Here is an example output from running a correct implementation of
this assignment for both parts 1 and 2:


\begin{verbatim}
f = 42.42
*fPtr = 42.42
**fPtrPtr = 42.42
***fPtrPtrPtr = 42.42

The value of a, dereferenced using aPtr and -> operator: 5
Two hops on chain away from a: 10
Three hops on chain away from c: 7
Four hops on chain away from a: 5
\end{verbatim}

\textbf{HINT}: You may find it helpful to draw diagrams of the pointers and
their references by hand, especially for the Part 2 exercise
using self-referential structure pointers.

\textbf{NOTE}: Now that our programs have more functions than just the
\verb~main()~ function, the use of the function headers becomes meaningful
and required.  Make sure that all of your functions have function
headers preceding them that document the purpose of the functions, and
the input parameters and return value of the function.
\section*{Assignment Submission}
\label{sec-4}


An eCollege dropbox has been created for this assignment.  You should
upload your version of the assignment to the eCollege dropbox named
\verb~Assg 11 Multiple Indirection~ created for this submission.  Work
submitted by the due date will be considered for evaluation.
\section*{Requirements and Grading Rubrics}
\label{sec-5}
\subsection*{Program Execution, Output and Functional Requirements}
\label{sec-5-1}


\begin{enumerate}
\item Your program must compile, run and produce some sort of output to
   be graded. 0 if not satisfied.
\item 40+ pts. For the correct coding of the Part 1 tasks.
\item 30+ pts. For correctly implementing creation and initialization of the Part
   2 structures.
\item 30+ pts. For correctly dereferencing the structure members as asked for.
\end{enumerate}
\subsection*{Program Style}
\label{sec-5-2}


Your programs must conform to the style and formatting guidelines
given for this course.  The following is a list of the guidelines that
are required for the assignment to be submitted this week.

\begin{enumerate}
\item The file header for the file with your name and program information
  and the function header for your main function must be present, and
  filled out correctly.
\item A function header must be present for all functions you define.
   You must document the purpose, input parameters and return values
   of all functions.  Your function headers must be formatted exactly
   as shown in the style guidelines for the class.
\item You must indent your code correctly and have no embedded tabs in
  your source code. (Don't forget about the Visual Studio Format
  Selection command).
\item You must not have any statements that are hacks in order to keep
   your terminal from closing when your program exits (e.g. no calls
   to system() ).
\item You must have a single space before and after each binary operator.
\item You must have a single blank line after the end of your declaration
  of variables at the top of a function, before the first code
  statement.
\item You must have a single blank space after , and \verb~;~ operators used as a
  separator in lists of variables, parameters or other control
  structures.
\item You must have opening \verb~{~ and closing \verb~}~ for control statement blocks
  on their own line, indented correctly for the level of the control
  statement block.
\item All control statement blocks (if, for, while, etc.) must have \verb~{~
   \verb~}~ enclosing them, even when they are not strictly necessary
   (when there is only 1 statement in the block).
\item You should attempt to use meaningful variable and function names in
   your program, for program clarity.  Of course, when required, you
   must name functions, parameters and variables as specified in the
   assignments.  Variable and function names must conform to correct
   \verb~camelCaseNameingConvention~ .
\item Put the \verb~*~ for pointer variable declarations next to the
   type declaration, with no space between the type and the \verb~*~.
   Also please follow the convention of using \verb~Ptr~ at the end of
   names for pointer variables.
\end{enumerate}

Failure to conform to any of these formatting and programming practice
guidelines for this assignment will result in at least 1/3 of the
points (33) for the assignment being removed for each guideline that
is not followed (up to 3 before getting a 0 for the
assignment). Failure to follow other class/textbook programming
guidelines may result in a loss of points, especially for those
programming practices given in our Deitel textbook that have been in
our required reading so far.

\end{document}
